In [1]:
import pandas as pd
import numpy as np

# DataFrame

In [2]:
data = np.random.randn(4,3)
data

array([[ 0.26494618, -0.86858045, -1.25711982],
       [ 1.63652351, -0.62600192,  0.93418497],
       [ 1.14320936,  0.41826698,  1.31100519],
       [-0.15671696,  1.31169603,  0.5857463 ]])

In [3]:
dataFrame=pd.DataFrame(data)
dataFrame

          0         1         2
0  0.264946 -0.868580 -1.257120
1  1.636524 -0.626002  0.934185
2  1.143209  0.418267  1.311005
3 -0.156717  1.311696  0.585746

In [4]:
print(dataFrame[0])

0    0.264946
1    1.636524
2    1.143209
3   -0.156717
Name: 0, dtype: float64

In [5]:
data2 = np.random.randint(10, size=(4, 3))

In [6]:
yeniDataFrame=pd.DataFrame(data2,index=["Atıl","Zeynep","Atlas","Mehmet"],columns=["Maaş","Yaş","Çalışma Saati"])

In [7]:
yeniDataFrame

        Maaş  Yaş  Çalışma Saati
Atıl       8    1              5
Zeynep     6    5              5
Atlas      6    4              4
Mehmet     6    1              2

In [8]:
yeniDataFrame["Çalışma Saati"]

Atıl      5
Zeynep    5
Atlas     4
Mehmet    2
Name: Çalışma Saati, dtype: int32

In [9]:
print(yeniDataFrame["Maaş"])

Atıl      8
Zeynep    6
Atlas     6
Mehmet    6
Name: Maaş, dtype: int32

In [10]:
yeniDataFrame[["Maaş","Yaş"]]

        Maaş  Yaş
Atıl       8    1
Zeynep     6    5
Atlas      6    4
Mehmet     6    1

In [11]:
#pandas column arama yapıyor (yeniDataFrame["Maaş"]) satırda arama direkt olmuyor, aşağıdaki gibi oluyor

In [12]:
yeniDataFrame.loc["Atıl"]

Maaş             8
Yaş              1
Çalışma Saati    5
Name: Atıl, dtype: int32

## DataFrame indeks

In [13]:
yeniDataFrame["Emeklilik Yaşı"] = yeniDataFrame["Yaş"] + yeniDataFrame["Yaş"] #dataframe sütun ekleme
yeniDataFrame

        Maaş  Yaş  Çalışma Saati  Emeklilik Yaşı
Atıl       8    1              5               2
Zeynep     6    5              5              10
Atlas      6    4              4               8
Mehmet     6    1              2               2

In [14]:
yeniDataFrame.drop("Emeklilik Yaşı",axis=1)  #axis=1 demek sütun oluyor

        Maaş  Yaş  Çalışma Saati
Atıl       8    1              5
Zeynep     6    5              5
Atlas      6    4              4
Mehmet     6    1              2

In [15]:
yeniDataFrame.drop("Mehmet",axis=0)  #axis=0 demek satır oluyor

        Maaş  Yaş  Çalışma Saati  Emeklilik Yaşı
Atıl       8    1              5               2
Zeynep     6    5              5              10
Atlas      6    4              4               8

In [16]:
yeniDataFrame  #drop işlemi yapılırken inplace=True parametresi olmazsa ana kütlede değişiklik olmaz

        Maaş  Yaş  Çalışma Saati  Emeklilik Yaşı
Atıl       8    1              5               2
Zeynep     6    5              5              10
Atlas      6    4              4               8
Mehmet     6    1              2               2

In [17]:
yeniDataFrame.drop("Emeklilik Yaşı",axis=1,inplace=True)
yeniDataFrame

        Maaş  Yaş  Çalışma Saati
Atıl       8    1              5
Zeynep     6    5              5
Atlas      6    4              4
Mehmet     6    1              2

In [22]:
yeniDataFrame.loc["Atıl"]["Maaş"]

8

In [28]:
yeniDataFrame.loc["Atıl"][:2]

Maaş    8
Yaş     1
Name: Atıl, dtype: int32

In [29]:
yeniDataFrame < 5

         Maaş    Yaş  Çalışma Saati
Atıl    False   True          False
Zeynep  False  False          False
Atlas   False   True           True
Mehmet  False   True           True

In [30]:
yeniDataFrame[yeniDataFrame<5]

        Maaş  Yaş  Çalışma Saati
Atıl     NaN  1.0            NaN
Zeynep   NaN  NaN            NaN
Atlas    NaN  4.0            4.0
Mehmet   NaN  1.0            2.0

In [31]:
booleanDataFrame = yeniDataFrame < 5
booleanDataFrame

         Maaş    Yaş  Çalışma Saati
Atıl    False   True          False
Zeynep  False  False          False
Atlas   False   True           True
Mehmet  False   True           True

In [32]:
yeniDataFrame

        Maaş  Yaş  Çalışma Saati
Atıl       8    1              5
Zeynep     6    5              5
Atlas      6    4              4
Mehmet     6    1              2

In [33]:
yeniDataFrame[booleanDataFrame]

        Maaş  Yaş  Çalışma Saati
Atıl     NaN  1.0            NaN
Zeynep   NaN  NaN            NaN
Atlas    NaN  4.0            4.0
Mehmet   NaN  1.0            2.0

In [34]:
yeniDataFrame[yeniDataFrame < 5]

        Maaş  Yaş  Çalışma Saati
Atıl     NaN  1.0            NaN
Zeynep   NaN  NaN            NaN
Atlas    NaN  4.0            4.0
Mehmet   NaN  1.0            2.0

In [35]:
yeniDataFrame["Yaş"] > 0

Atıl      True
Zeynep    True
Atlas     True
Mehmet    True
Name: Yaş, dtype: bool

In [38]:
yeniDataFrame[yeniDataFrame["Yaş"] > 2]  #yaşı 2'den büyük olanları getiriyor.

        Maaş  Yaş  Çalışma Saati
Zeynep     6    5              5
Atlas      6    4              4

## Index değiştirme

In [39]:
yeniIndeksListesi=["Ati","Zey","Atl","Meh"]

In [40]:
yeniDataFrame["Yeni Index"]=yeniIndeksListesi

In [41]:
yeniDataFrame

        Maaş  Yaş  Çalışma Saati Yeni Index
Atıl       8    1              5        Ati
Zeynep     6    5              5        Zey
Atlas      6    4              4        Atl
Mehmet     6    1              2        Meh

In [42]:
yeniDataFrame.set_index("Yeni Index")

            Maaş  Yaş  Çalışma Saati
Yeni Index
Ati            8    1              5
Zey            6    5              5
Atl            6    4              4
Meh            6    1              2

In [45]:
yeniDataFrame  #inplace=True yapmadığım için değişiklikler kaydolmadı

        Maaş  Yaş  Çalışma Saati Yeni Index
Atıl       8    1              5        Ati
Zeynep     6    5              5        Zey
Atlas      6    4              4        Atl
Mehmet     6    1              2        Meh

In [46]:
yeniDataFrame.set_index("Yeni Index",inplace=True)

In [47]:
yeniDataFrame

            Maaş  Yaş  Çalışma Saati
Yeni Index
Ati            8    1              5
Zey            6    5              5
Atl            6    4              4
Meh            6    1              2

In [50]:
yeniDataFrame.loc["Ati"]

Maaş             8
Yaş              1
Çalışma Saati    5
Name: Ati, dtype: int32